AUTO_config_TK_pesok/src/ExchangePlans/ОбменФронт/ОбменФронт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="5a580992-6e36-4bf8-a2b8-0b90cc74f643">
  <name>ОбменФронт</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанныхТранзит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПорции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИтогиИнвентаризации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПеремещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

AUTO_config_TK_pesok/src/ExchangePlans/ОбменФронт/ManagerModule.bsl
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
КонецПроцедуры

Функция ПолучитьЭтотУзелПланаОбмена(УзелОбмена) Экспорт
	
	Возврат (УзелОбмена = ПланыОбмена.ОбменФронт.ЭтотУзел());

КонецФункции


Функция ПолучитьУзелОбмена(Подразделение)Экспорт
	Возврат ОбменФронтПовтИсп.УзелОбмена(Подразделение);
КонецФункции


Функция ЗаполнитьПараметрыОбмена(УзелОбмена) Экспорт
	
	
	ПараметрыОбмена = Новый Структура("ПодразделениеКомпании,УзелОбмена,КодУзлаОбмена,РазмерПорции,КоличествоПовторов,ВыгружатьОстатки,ВыгружатьТекущиеОстатки,НастройкиПодключения");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.Ссылка КАК УзелОбмена,
	|	ОбменФронт.Код КАК КодУзлаОбмена,
	|	ОбменФронт.АдресСервера КАК АдресСервера,
	|	ОбменФронт.БазаДанных КАК БазаДанных,
	|	ОбменФронт.БазаДанныхТранзит КАК БазаДанныхТранзит,
	|	ОбменФронт.ИмяПользователя КАК ИмяПользователя,
	|	ОбменФронт.Пароль КАК Пароль,
	|	ОбменФронт.РазмерПорции КАК РазмерПорции,
	|	ОбменФронт.КоличествоПовторений КАК КоличествоПовторов,
	|	ОбменФронт.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ОбменФронт.ВыгружатьОстатки КАК ВыгружатьОстатки,
	|	ОбменФронт.ВыгружатьТекущиеОстатки КАК ВыгружатьТекущиеОстатки
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	ОбменФронт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Если  ОбменФронтПовтИсп.ЭтоПодразделениеАттика(ВыборкаДетальныеЗаписи.ПодразделениеКомпании)Тогда
		МассивПодразделений = ОбменФронтПовтИсп.МассивПодразделенийАттика();
	ИначеЕсли  ОбменФронтПовтИсп.ЭтоПодрзаделениеБафит(ВыборкаДетальныеЗаписи.ПодразделениеКомпании)Тогда
		МассивПодразделений = ОбменФронтПовтИсп.МассивПодразделенийБафет();
	Иначе
		МассивПодразделений = Новый Массив;
		МассивПодразделений.Добавить(ВыборкаДетальныеЗаписи.ПодразделениеКомпании);
	КонецЕсли;
	ПараметрыОбмена.Вставить("ПодразделениеКомпании",МассивПодразделений);	
	
	ЗаполнитьЗначенияСвойств(ПараметрыОбмена,ВыборкаДетальныеЗаписи,"УзелОбмена,КодУзлаОбмена,РазмерПорции,КоличествоПовторов,ВыгружатьОстатки,ВыгружатьТекущиеОстатки");
	
	
	НастрокиПодключения = СтруктураНастрокиПодключения();
	ЗаполнитьНастройкиПодключения(НастрокиПодключения,ВыборкаДетальныеЗаписи);
	
	ПараметрыОбмена.НастройкиПодключения = НастрокиПодключения;
	
	Возврат ПараметрыОбмена;
	
КонецФункции

Функция ЗаполнитьПараметрыПодключения(УзелОбмена)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастрокиПодключения = СтруктураНастрокиПодключения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.АдресСервера КАК АдресСервера,
	|	ОбменФронт.БазаДанных КАК БазаДанных,
	|	ОбменФронт.БазаДанныхТранзит КАК БазаДанныхТранзит,
	|	ОбменФронт.ИмяПользователя КАК ИмяПользователя,
	|	ОбменФронт.Пароль КАК Пароль
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	ОбменФронт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();

	ЗаполнитьНастройкиПодключения(НастрокиПодключения,ВыборкаДетальныеЗаписи);

	Возврат НастрокиПодключения;
	
	
КонецФункции


Функция СтруктураНастрокиПодключения()  Экспорт
	
	Возврат Новый Структура("ИмяПользователя,Пароль,АдресСервера,БазаДанных,БазаДанныхТранзит");
	
КонецФункции


Процедура ЗаполнитьНастройкиПодключения(НастройкиПодлючения,ДанныеЗаполнения)Экспорт
	
	ЗаполнитьЗначенияСвойств(НастройкиПодлючения,ДанныеЗаполнения,"ИмяПользователя,Пароль,АдресСервера,БазаДанных,БазаДанныхТранзит");
	
КонецПроцедуры

Функция ПолучитьМассивУзловВыгрузкиОстатковТовара()Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменФронт.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменФронт КАК ОбменФронт
		|ГДЕ
		|	ОбменФронт.ПометкаУдаления = ЛОЖЬ
		|	И НЕ ОбменФронт.ЭтотУзел
		|	И (ОбменФронт.ВыгружатьОстатки
		|			ИЛИ ОбменФронт.ВыгружатьТекущиеОстатки)";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивУзлов
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий()Цикл 
		МассивУзлов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции
